# 1. Пользователь вводит строку. Выведите строку в
# обратном порядке.
a=input()












# 2. Пользователь вводит строку. Выведите каждый
# второй символ строки, начиная с первого
#
# 3. Пользователь вводит строку. Выведите строку,
# состоящую из первых пяти и последних пяти
# символов.
#
# 4. Напишите программу, которая выводит на экран
# количество символов в ведённой пользователем
# строке на экран
#
# 5. Пользователь вводит строку. Выведите индекс первого вхождения
# буквы о. Если буквы о нет, выведите сообщение об этом.
#
# 6. Найдите индекс последнего вхождения буквы "а"
# в строке, введённой пользователем