# 1. Пользователь вводит строку. Определите,
# оканчивается ли строка на "ов".
# a=input()
# if a[-2:]=='ов':
#     print('yes')
# else:
#     print('no')
# # 2. Пользователь вводит строку. Определите,
# # содержит ли она хотя бы одну цифру.
# a=input()
# print(a.isalpha())
# 3. Разбейте строку по пробелам и соедините
# обратно через запятую.





# 4.Удалите все гласные буквы из строки.
a="aoiuyeAOIUYE"
s='hello my friend'
b=""
for i in a:
    if i in s:
        s.replace(i,"")
print(b)
